unidad-3/2/actividades_afianzamiento_3.2.org
#+TITLE: Práctico Nro. 3.2: Tipos de Dato Colección - Listas
#+AUTHOR: Juan Jose Della Vecchia
#+PROPERTY: header-args+ :mkdirp yes
#+STARTUP: overview

Nota: Asuma una cantidad especíca de elementos cuando el ejercicio no lo
especique.

* Ejercicio 1:
Dada la siguiente lista l=[10,"hola",2.5,20,"que",3.5,30,"tal",4.5]
se pide recuperar:
1. el 30
2. "hola"
3. 10,"hola",2.5
4. Los strings
5. Los flotantes
6. Los enteros
#+begin_src python :tangle ./ejercicios/01.py :results output
  l = [10,"hola",2.5,20,"que",3.5,30,"tal",4.5]
  print (l[6])
  print (l[2])
  print (l[:3])
  strings = "hola"
  flotantes = 1.0
  enteros = 1
  print ("Los strings son:", strings)
  print ("los flotantes son:", flotantes)
  print ("los enteros son:", enteros)
#+end_src

#+RESULTS:
: 30
: 2.5
: [10, 'hola', 2.5]
: Los strings son: hola
: los flotantes son: 1.0
: los enteros son: 1

* Ejercicio 2:
Realice las siguientes actividades:
1. Defina una lista l de tres números donde cada número es 0.
2. Defina una lista de un único elemento.
3. Defina una lista con n 0s.
#+begin_src python :tangle ./ejercicios/02.py

#+end_src
* Ejercicio 3:
Defina las listas l0 y l1 cada una con dos elementos numéricos

y luego construya la lista r cuyos elementos son la suma de los elemen-
tos de l0 y l1. Ejemplo: Si l0=[10,20] y l1=[8,20] la tupla r tiene que

contener r=[18,40].
#+begin_src python :tangle ./ejercicios/03.py

#+end_src
* Ejercicio 4:
Escriba un ejemplo que muestre que las listas son mutables.
#+begin_src python :tangle ./ejercicios/04.py

#+end_src
* Ejercicio 5:
Escriba un programa que dada una lista t con 5 elementos y
un número n produzca como resultado una nueva lista con todos los
elementos de la lista t multiplicados por el número n.
#+begin_src python :tangle ./ejercicios/05.py :results output
  l = [ 1, 1, 2, 3, 5]
  n = 3
  nueval = []
  nueval = list(map (lambda el:el*n, l))
  print(nueval)
#+end_src

#+RESULTS:
: [3, 3, 6, 9, 15]

* Ejercicio 6:
Escriba un programa que almacene el valor de tres variables
ingresadas por el usuario en una lista.
#+begin_src python :tangle ./ejercicios/06.py
  lista = []
  for x in range(3):
    n = input ("ingrese un elemento para agregar a la lista: ")
    lista.append(n)
    
  print(lista)
#+end_src
* Ejercicio 7:
Escriba un programa que:
1. Permita que el usuario ingrese cuatro números, los almacene una
lista l.
2. Genere una lista s la cual se obtiene sumando a cada elemento de
l un valor ingresado por el usuario.
3. Genere una lista r la cual se obtiene restando a cada elemento de
l un valor ingresado por el usuario.
4. Imprima: con leyendas adecuadas la tupla l, s y r.
#+begin_src python :tangle ./ejercicios/07.py
  lista = []
  for x in range(4):
    n = int(input ("ingrese un numero para agregar a la lista: "))
    lista.append(n)
    
  print(lista)
#+end_src
* Ejercicio 8:
Cree una lista y muestre:
1. El acceso a un elemento de la lista.
2. Qué sucede si se intenta acceder a una posición inexistente de la
lista.
3. Cómo se calcula la longitud de una lista.
#+begin_src python :tangle ./ejercicios/08.py

#+end_src
* Ejercicio 9:
Construya un programa que permita que el usuario ingrese una
lista de dos elementos y luego desempaquete la lista en dos variables a
y b. Luego el programa debe imprimir las variables a y b.
#+begin_src python :tangle ./ejercicios/09.py

#+end_src
* Ejercicio 10:
Escriba un programa que permita que el usuario ingrese dos
valores en las variables a y b y luego empaquete dichos valores en una
lista. Luego el programa debe imprimir la tupla resultado.
#+begin_src python :tangle ./ejercicios/10.py

#+end_src
* Ejercicio 11:
Escriba un programa que permita que el usuario ingrese un
número a y una lista l. Luego el programa debe imprimir True si el
número a está en l y False en otro caso.
#+begin_src python :tangle ./ejercicios/11.py

#+end_src
* Ejercicio 12:
Escriba un programa que permita que el usuario ingrese un
número a y una lista l. Luego el programa debe imprimir por pantalla
la posición del número a en la lista l. En caso de que el número a no se
encuentre en l el programa debe imprimir -1.
#+begin_src python :tangle ./ejercicios/12.py

#+end_src
* Ejercicio 13:
Realice las siguientes actividades:
1. Explique el concepto de rodaja.
2. Explique el concepto de zancada.
3. Por cada concepto explicado de ejemplos.
#+begin_src python :tangle ./ejercicios/13.py

#+end_src
* Ejercicio 14:
Escriba un programa que permita que el usuario ingrese un
número a y una lista l. Luego el programa debe mostrar por pantalla
la cantidad de veces que aparece el número a en la lista l.
#+begin_src python :tangle ./ejercicios/14.py

#+end_src
* Ejercicio 15:
Dada la lista l=[34, 3.2, Juan, Pedro,-2] se pide:
1. Agregue al nal de l un string ingresado por el usuario.
2. Solicite al usuario un elemento y cuente la cantidad de veces que
aparece dicho elemento en l.
3. Pida al usuario una lista s e incorporela al nal de l.
4. Invierta la lista l.
#+begin_src python :tangle ./ejercicios/15.py

#+end_src
* Ejercicio 16:
Construya un programa que:
1. Permita que el usuario ingrese una lista l de números enteros l.
2. Ordene la lista
3. Almacene en la variable mayor el mayor elemento de la lista
4. Almacene en la variable menor el menor elemento de la lista.
5. Imprima por pantalla la lista l y el elemento mayor y el elemento
menor.
#+begin_src python :tangle ./ejercicios/16.py

#+end_src
* Ejercicio 17:
Escriba un programa que:
1. Permita que el usuario ingrese una lista l.
2. Pida al usuario en elemento e.
3. Pida al usuario una posición p válida.
4. Inserte en la lista l el elemento e en la posición p.
#+begin_src python :tangle ./ejercicios/17.py

#+end_src
